Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::PreferenceTableContainerBase::Modifier Class Reference
MEP Element Manager
Modifier of the PreferenceTableContainerBase. More...
#include <MEPPreferenceTableContainerBase.hpp>
 Inheritance diagram for ACAPI::MEP::PreferenceTableContainerBase::Modifier:
 Public Member Functions
Result< UniqueID >  | AddNewTable (GS::UniString tableName, const std::optional< API_Guid > &requiredId=std::nullopt)
Inserts a new PreferenceTable into the container.
Result< void >  | Delete (const UniqueID &uniqueId)
Deletes a PreferenceTable from the container.
 Protected Member Functions
Modifier (PreferenceTableContainerBase &parent)
Constructs a Modifier with the given PreferenceTableContainerBase.
Detailed Description
Modifier of the PreferenceTableContainerBase.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::PreferenceTableContainerBase::Modifier::Modifier  |  ( |  PreferenceTableContainerBase & |  parent | )
protected
Constructs a Modifier with the given PreferenceTableContainerBase.
Parameters
parent | The given PreferenceTableContainerBase.
Member Function Documentation
◆ AddNewTable()
 Result< UniqueID > ACAPI::MEP::PreferenceTableContainerBase::Modifier::AddNewTable  |  ( |  GS::UniString |  tableName,
|  const std::optional< API_Guid > & |  requiredId = std::nullopt )
Inserts a new PreferenceTable into the container.
Parameters
tableName | The name of the table. It will be trimmed of leading and trailing whitespaces. This must be a non-empty and currently non-existent name in the container.
requiredId | The guid to be set for the PreferenceTable - optional parameter
Returns
In case of successful insertion, returns the UniqueID of the newly inserted table.
◆ Delete()
 Result< void > ACAPI::MEP::PreferenceTableContainerBase::Modifier::Delete  |  ( |  const UniqueID & |  uniqueId | )
Deletes a PreferenceTable from the container.
Parameters
uniqueId | The UniqueID of the table.
Returns
Returns an error if the parameter does not identify a PreferenceTable, otherwise nothing.